Revit 2016 API
Level.Create Method
 Creates a new instance of level based on an input elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static Level Create(
	Document document,
	double elevation
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	elevation As Double _
) As Level
Visual C++
public:
static Level^ Create(
	Document^ document,
	double elevation
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which the new instance is created
elevation
Type: System.Double
 The elevation of the level to be created.
Return Value
 The newly created level instance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Level Class
Autodesk.Revit.DB Namespace